export const COMPANY_NAME = "Cloudy";

export const TERM_OF_USE_TEXT = `
1. Общие положения

1.1. Сервис ${COMPANY_NAME} (далее – Сервис) предоставляет пользователям возможность хранить и обрабатывать данные в облачной среде.
1.2. Настоящие Правила обработки данных (далее – Правила) определяют порядок сбора, хранения, обработки, передачи и защиты персональных данных Пользователей Сервиса.
1.3. Пользователь, регистрируясь в Сервисе, выражает свое согласие с настоящими Правилами.

2. Сбор и хранение данных

2.1. Сервис собирает следующие данные о Пользователях:
* Персональные данные: имя, фамилия, адрес электронной почты.
* Данные об использовании Сервиса: дата и время регистрации, IP-адрес, информация о хранимых и обрабатываемых данных, действия, совершаемые в Сервисе.
2.2. Данные Пользователей хранятся на серверах Сервиса, расположенных в дата-центрах, сертифицированных по международным стандартам безопасности.
2.3. Сервис использует различные меры безопасности для защиты данных Пользователей от несанкционированного доступа, использования, разглашения, изменения или уничтожения.

3. Обработка данных

3.1. Сервис обрабатывает данные Пользователей в следующих целях:
* Предоставление доступа к Сервису и его функциям.
* Улучшение работы Сервиса.
* Обеспечение безопасности Сервиса.
* Направление Пользователям рекламных и информационных материалов.
3.2. Сервис не передает данные Пользователей третьим лицам без их согласия, за исключением случаев, предусмотренных законодательством Российской Федерации.

4. Права Пользователей

4.1. Пользователи имеют право:
* Доступать к своим данным.
* Требовать исправления или удаления своих данных.
* Отзывать согласие на обработку своих данных.
* Ограничивать обработку своих данных.
* Возражать против обработки своих данных.
* Переносить свои данные на другой сервис.
4.2. Для реализации своих прав Пользователи могут обратиться в службу поддержки Сервиса по электронной почте palma21042005@gmail.com.

5. Заключительные положения

5.1. Сервис вправе вносить изменения в настоящие Правила.
5.2. Обновленная версия Правил вступает в силу с момента ее публикации на сайте Сервиса.
5.3. Пользователь обязан ознакомиться с актуальной версией Правил.

6. Контактная информация

6.1. Служба поддержки Сервиса:
* Email: palma21042005@gmail.com.
* Телефон: 8 (800) 555-35-35

7. Приложения

7.1. Политика конфиденциальности
7.2. Соглашение об уровне обслуживания

8. Согласие на обработку персональных данных

Я, ФИО, даю свое согласие Обществу с ограниченной ответственностью "${COMPANY_NAME}", адрес: Россия, г. Ростов-на-Дону, ул. Еременко, д. 1, на обработку своих персональных данных, указанных в настоящем Согласии, а также иных персональных данных, полученных в процессе моего использования Сервиса ${COMPANY_NAME}.

Согласие дается на срок 10 лет.

Я согласен на обработку своих персональных данных, включая сбор, хранение, систематизацию, накопление, уточнение (обновление, изменение), использование, распространение (в том числе передачу третьим лицам), обезличивание, блокирование, уничтожение, а также на осуществление любых иных действий, необходимых для обработки персональных данных, как с использованием средств автоматизации, так и без использования таковых.

Я проинформирован(а) о том, что мои персональные данные могут быть переданы третьим лицам, в том числе, но не ограничиваясь:

Партнерам Сервиса ${COMPANY_NAME}, участвующим в предоставлении мне услуг;
Государственным органам в рамках их полномочий;
Иным лицам, с моего согласия.
Я оставляю за собой право отозвать свое согласие на обработку персональных данных в любой момент, направив письменное уведомление по адресу: Россия, г. Ростов-на-Дону, ул. Еременко, д. 1.`;
